app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    authorize @student
    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "department", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    authorize @student
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "name" = ?, "department" = ?, "phone" = ?, "email" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "student1"], ["department", "ECE"], ["phone", "9876543012"], ["email", "student1@student1.com"], ["updated_at", "2021-03-16 07:21:06.562482"], ["id", 55]]

  def destroy
    authorize @student
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 2]]