app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("name", "department", "grade", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @teacher = Teacher.new(teacher_params)
    authorize @teacher
    respond_to do |format|
      if @teacher.save

UPDATE "teachers" SET "name" = ?, "grade" = ?, "phone" = ?, "email" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["name", "test teacher"], ["grade", "Asst.prof"], ["phone", "9876543120"], ["email", "teacher1@test1.com"], ["updated_at", "2021-03-16 09:01:47.255817"], ["id", 68]]
---
  def update
    authorize @teacher
    respond_to do |format|
      if @teacher.update(teacher_params)

DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 62]]
---
  def destroy
    authorize @teacher
    @teacher.destroy