app/models/user.rb

  def welcome_msg
    ActionJob.set(wait: 3.seconds).perform_later(User.last)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]